IdeaRS.Connections
FasteningData.BoltStartOffest Property
Compatible with IDEA StatiCa 0.0
 Timber bolt grid offset from relative beginning of beam (beginning means the cut of ended beam or middle point of the continuous beam)
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double BoltStartOffest { get; set; }
Property Value
Type: Double
See Also
Reference
FasteningData Class
IdeaRS.Connections.Data Namespace